==================
notes
==================

c
c

---

    (source_file
      (decl_list
        (decl
          (note_list
            (note_object
              (symbol
                (char)))))
        (decl
          (note_list
            (note_object
              (symbol
                (char)))))))

==================
note lists
==================

cc

---

    (source_file
      (decl_list
        (decl
          (note_list
            (note_object
              (symbol
                (char)))
            (note_object
              (symbol
                (char)))))))

==================
note properties
==================

cc8.

---

    (source_file
      (decl_list
        (decl
          (note_list
            (note_object
              (symbol
                (char)))
            (note_object
              (symbol
                (char))
              (property)
              (property))))))

==================
note groups
==================

c[cc]8

---

    (source_file
      (decl_list
        (decl
          (note_list
            (note_object
              (symbol
                (char)))
            (note_object
              (note_list
                (note_object
                  (symbol
                    (char)))
                (note_object
                  (symbol
                    (char))))
              (property))))))
