==================
single note
==================

c

---

    (source_file
      (note_list
        (symbol
          (char))))


==================
notes and rests
==================

-c
c-

---

    (source_file
      (note_list
        (symbol
          (rest))
        (symbol
          (char)))
      (note_list
        (symbol
          (char))
        (symbol
          (rest))))

==================
note lists
==================

cc

---

    (source_file
      (note_list
        (symbol
          (char))
        (symbol
          (char))))

==================
note properties
==================

cc8.

---

    (source_file
      (note_list
        (symbol
          (char))
        (symbol
          (char))
        (property)
        (property)))

==================
note groups
==================

c[cc]8

---

    (source_file
      (note_list
        (symbol
          (char))
        (note_list
          (symbol
            (char))
          (symbol
            (char)))
        (property)))
