==================
single note
==================

c

---

    (source_file
      (decl_list
        (note_list
          (char))))


==================
notes and rests
==================

-c
c-

---

    (source_file
      (decl_list
        (note_list
          (rest)
          (char))
        (note_list
          (char)
          (rest))))

==================
note lists
==================

cc

---

    (source_file
      (decl_list
        (note_list
          (char)
          (char))))

==================
note properties
==================

cc8.

---

    (source_file
      (decl_list
        (note_list
          (char)
          (char)
          (property)
          (property))))

==================
note groups
==================

c[cc]8

---

    (source_file
      (decl_list
        (note_list
          (char)
          (note_list
            (char)
            (char))
          (property))))
